import Link from 'next/link';
import s from './delivery.module.scss';

const ProductPageDelivery = async () => {
  return (
    <>
      <h3>Оплата та доставка</h3>
      <div className={s.process}>
        <h4>Процес купівлі в нашому магазині</h4>
        <ul>
          <li>1. Оберіть на сайті товари, які хочете придбати.</li>
          <li>2. Додайте товар в кошик натиснувши кнопку купити.</li>
          <li>3. Перейдіть в кошик натиснувши по значку кошика в верхній частині екрану.</li>
          <li>
            4. Впевніться що додали всі необхідні товари, та якщо все вірно, - натисніть кнопку Оформити замовлення.
          </li>
          <li>5. Введіть дані необхідні для замовлення та натисніть кнопку Підтвердити замовлення.</li>
          <li>
            6. Замовлення зроблено. Очікуйте на дзвінок від нашого менеджера для уточнення деталей, або повідомлення про
            відправку замовлення.
          </li>
          <li>7. Отримайте замовлення та насолоджуйтесь якісною продукцію за чесними цінами.</li>
        </ul>
      </div>

      <div className={s.delivery}>
        <h4>Доставка</h4>
        <ul>
          <li>Доставка здійснюється транспортними компаніями <span>Нова пошта</span> та <span>Укр Пошта</span> по всій території України, які є безпечними для здійснення доставок.</li>
          <li>Доставка здійснюється в відділення транспортної компанії або курєром, за вказаною адресою.</li>
          <li>Вартість доставки формується відповідно до тарифів транспортної компанії.</li>
          <li>Доставка здійснюється щоденно за виключенням Неділі.</li>
          <li>Зазвичай, доставка здійснюється протягом 2-5 днів після оформлення замовлення.</li>
          <li>
            <p> Знайти найближче до вас відділення транспортної компанії можна за посиланнями:</p>
            <Link href="https://novaposhta.ua/office/list">Нова пошта</Link>
            <Link href="https://offices.ukrposhta.ua/">Укр пошта</Link>
          </li>
        </ul>
      </div>

      <div className={s.process}>
        <h4>Оплата</h4>
        <p>Ви можете оплатити за мовлення такими способами:</p>
        <ul>
          <li>
            1. Оплата за реквізитами компанії - так ви економите частину коштів за доставку, оскільки не сплачуєте
            додаткову комісію транспортній компанії за перерахунок коштів.
          </li>
          <li>
            2. Післяплата при отриманні замовлення - так ви особисто перевіряєте та оглядаєте товар за місцем доставки,
            і тільки після цього здійснюєте оплату.
          </li>
        </ul>
      </div>
    </>
  );
};

export default ProductPageDelivery;
