import * as Yup from 'yup';


export const addReviewValidation = Yup.object().shape({
  name: Yup.string()
    .required('Поле має бути заповнене')
    .min(2, 'Мінімальна довжина імені 2 символи')
    .max(50, 'Максимальна довжина імені 50 символів')
    .matches(
      /^[a-zA-Zа-яА-ЯҐґЄєІіЇї\s\d$&+,=_@#Nº№'<>^*()%'’`.,:;"()!?/+-]+$/,
      'Введіть коректну назву'
    ),
  text: Yup.string()
    .min(2, 'Мінімальна довжина тексту 2 символи')
    .max(2000, 'Максимальна довжина тексту 2000 символів')
    .matches(
      /^[a-zA-Zа-яА-ЯҐґЄєІіЇї\s\d$&+,=_@#Nº№'<>^*()%'’`.,:;"()!?/+-]+$/,
      'Введіть коректний текст'
    ),
  
});
