import s from './how-to-buy-block.module.scss';

const HowToBuyBlock = () => {
  return (
    <ul className={s.list}>
      <li>1. Оберіть на сайті товари, які хочете придбати.</li>
      <li>2. Додайте товар в кошик натиснувши кнопку купити.</li>
      <li>3. Перейдіть в кошик натиснувши на кнопку кошика в верхній частині екрану.</li>
      <li>4. Впевніться що додали всі необхідні товари, та якщо все вірно, - натисніть кнопку Оформити замовлення.</li>
      <li>5. Введіть дані необхідні для замовлення та натисніть кнопку Підтвердити замовлення.</li>
      <li>
        6. Замовлення зроблено. Очікуйте на дзвінок від нашого менеджера для уточнення деталей, або повідомлення про
        відправку замовлення.
      </li>
      <li>7. Отримайте замовлення та насолоджуйтесь якісною продукцію за чесними цінами.</li>
    </ul>
  );
};

export default HowToBuyBlock;
